{"class_name": "Model", "keras_version": "2.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4096], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4096], "name": "input_4", "sparse": false}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "Lambda", "config": {"function": ["YwIAAAAEAAAABQAAAEMAAABzZwAAAHwAAFwCAH0CAH0DAHwBAHI/AHQAAGoBAHwCAGQBAGQCAIMB\nAX0CAHQAAGoBAHwCAGQBAGQCAIMBAX0DAG4AAHQAAGoCAHQAAGoDAHwCAHwDAGcCAGQBAGQDAIMB\nAWQBAGQDAIMBAVMoBAAAAE50BAAAAGF4aXNpAAAAAGkBAAAAKAQAAAB0AQAAAEt0DAAAAGwyX25v\ncm1hbGl6ZXQEAAAAcHJvZHQFAAAAc3RhY2soBAAAAHQEAAAAdmVjc3QJAAAAbm9ybWFsaXpldAEA\nAAB4dAEAAAB5KAAAAAAoAAAAAHMfAAAAPGlweXRob24taW5wdXQtMTItMjc2MTgwMGRiMDg0PnQP\nAAAAY29zaW5lX2Rpc3RhbmNlAQAAAHMKAAAAAAEMAQYBFQEYAQ==\n", [false], null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["YwEAAAABAAAAAgAAAEMAAABzCAAAAHwAAGQBABlTKAIAAABOaQAAAAAoAAAAACgBAAAAdAYAAABz\naGFwZXMoAAAAACgAAAAAcx8AAAA8aXB5dGhvbi1pbnB1dC0xMi0yNzYxODAwZGIwODQ+dBwAAABj\nb3NpbmVfZGlzdGFuY2Vfb3V0cHV0X3NoYXBlCAAAAHMCAAAAAAE=\n", null, null], "output_shape_type": "lambda"}, "inbound_nodes": [[["input_3", 0, 0, {}], ["input_4", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "dense_3"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "activation_3"}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["activation_3", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}